<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"production","backend":"8977faf11c06b88180f3cf3e4cf2f68fa8bc0e9883ea3961221a6524dc47d956","plan_job_ref":"Job Pull Request Checks #463 at https://github.com/GSA-TTS/FAC/actions/runs/22347588750","plan_out_hash":"19140042b1e1d7dde4e254791f12c7297d1f9a263022e362ef3d9b27a169e1db","plan_hash":"016a28f5df9bbf35a8cd1c7ac04e3f4800dff48b360adc7285b99042b8a6397b","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan for __production__
<details>
<summary>Plan: 5 to add, 10 to change, 8 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.production.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2026-02-05T18:02:37Z" -> (known after apply)
        }
    }

  # module.production.module.metabase-app.data.cloudfoundry_domain.public will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "public" {
+       annotations         = (known after apply)
+       created_at          = (known after apply)
+       id                  = (known after apply)
+       internal            = (known after apply)
+       labels              = (known after apply)
+       name                = "app.cloud.gov"
+       org                 = (known after apply)
+       router_group        = (known after apply)
+       shared_orgs         = (known after apply)
+       supported_protocols = (known after apply)
+       updated_at          = (known after apply)
    }

  # module.production.module.metabase-app.data.cloudfoundry_org.app_org will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_org" "app_org" {
+       annotations = (known after apply)
+       created_at  = (known after apply)
+       id          = (known after apply)
+       labels      = (known after apply)
+       name        = "gsa-tts-oros-fac"
+       quota       = (known after apply)
+       suspended   = (known after apply)
+       updated_at  = (known after apply)
    }

  # module.production.module.metabase-app.data.cloudfoundry_space.app_space will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "app_space" {
+       allow_ssh         = (known after apply)
+       annotations       = (known after apply)
+       created_at        = (known after apply)
+       id                = (known after apply)
+       isolation_segment = (known after apply)
+       labels            = (known after apply)
+       name              = "production"
+       org               = (known after apply)
+       quota             = (known after apply)
+       updated_at        = (known after apply)
    }

  # module.production.module.metabase-app.data.docker_registry_image.metabase will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "docker_registry_image" "metabase" {
+       id            = (known after apply)
+       name          = "metabase/metabase:latest"
+       sha256_digest = (known after apply)
    }

  # module.production.module.metabase-app.cloudfoundry_app.metabase will be created
+   resource "cloudfoundry_app" "metabase" {
+       buildpacks                  = (known after apply)
+       command                     = <<-EOT
            MB_DB_CONNECTION_URI=$(echo "$VCAP_SERVICES" | grep -o '"uri":\s*"[^"]*' | sed 's/"uri":\s*//' | cut -d '"' -f2 | tail -1)
            export MB_DB_CONNECTION_URI
            
            ./app/run_metabase.sh
        EOT
+       created_at                  = (known after apply)
+       disk_quota                  = "3072M"
+       docker_image                = (known after apply)
+       enable_ssh                  = (known after apply)
+       environment                 = {
+           "ENV"                = "production"
+           "REQUESTS_CA_BUNDLE" = "/etc/ssl/certs/ca-certificates.crt"
+           "SSL_CERT_FILE"      = "/etc/ssl/certs/ca-certificates.crt"
        }
+       health_check_http_endpoint  = "/api/health"
+       health_check_type           = "http"
+       id                          = (known after apply)
+       instances                   = 1
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = "2048M"
+       name                        = "metabase"
+       org_name                    = "gsa-tts-oros-fac"
+       readiness_health_check_type = (known after apply)
+       routes                      = (known after apply)
+       service_bindings            = [
+           {
+               params           = jsonencode({})
+               service_instance = "fac-db"
            },
+           {
+               params           = jsonencode({})
+               service_instance = "https-proxy-creds"
            },
+           {
+               params           = jsonencode({})
+               service_instance = "metabase-db"
            },
        ]
+       space_name                  = "production"
+       stack                       = (known after apply)
+       strategy                    = "rolling"
+       updated_at                  = (known after apply)
    }

  # module.production.module.metabase-app.cloudfoundry_route.app_route will be created
+   resource "cloudfoundry_route" "app_route" {
+       created_at   = (known after apply)
+       destinations = [
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
+       domain       = (known after apply)
+       host         = "metabase-production"
+       id           = (known after apply)
+       protocol     = (known after apply)
+       space        = (known after apply)
+       updated_at   = (known after apply)
+       url          = (known after apply)
    }

  # module.production.module.metabasedb.cloudfoundry_service_instance.rds[0] will be created
+   resource "cloudfoundry_service_instance" "rds" {
+       created_at        = (known after apply)
+       dashboard_url     = (known after apply)
+       id                = (known after apply)
+       last_operation    = (known after apply)
+       maintenance_info  = (known after apply)
+       name              = "metabase-db"
+       parameters        = (sensitive value)
+       service_plan      = "58b899e8-eb36-441f-b406-d2f5b1e49c00"
+       space             = "5593dba8-7023-49a5-bdbe-e809fe23edf9"
+       tags              = [
+           "rds",
+           "terraform-cloudgov-managed",
        ]
+       type              = "managed"
+       updated_at        = (known after apply)
+       upgrade_available = (known after apply)
    }

  # module.production.module.newrelic.newrelic_alert_policy.alert_policy will be destroyed
  # (because newrelic_alert_policy.alert_policy is not in configuration)
-   resource "newrelic_alert_policy" "alert_policy" {
-       account_id          = 3919076 -> null
-       id                  = "5422816" -> null
-       incident_preference = "PER_POLICY" -> null
-       name                = "production-alert-policy" -> null
    }

  # module.production.module.newrelic.newrelic_notification_channel.email_channel will be destroyed
  # (because newrelic_notification_channel.email_channel is not in configuration)
-   resource "newrelic_notification_channel" "email_channel" {
-       account_id     = 3919076 -> null
-       active         = true -> null
-       destination_id = "e7c0bf9e-3e32-454e-98e6-40aa0694adbc" -> null
-       id             = "574ef83e-304c-4097-a367-d1c4e2278d91" -> null
-       name           = "production_email_notification_channel" -> null
-       product        = "IINT" -> null
-       status         = "DEFAULT" -> null
-       type           = "EMAIL" -> null

-       property {
-           key           = "source" -> null
-           label         = "terraform-source-internal" -> null
-           value         = "terraform" -> null
#            (1 unchanged attribute hidden)
        }
-       property {
-           key           = "subject" -> null
-           value         = "{{issueTitle}}" -> null
#            (2 unchanged attributes hidden)
        }
    }

  # module.production.module.newrelic.newrelic_notification_destination.email_destination will be destroyed
  # (because newrelic_notification_destination.email_destination is not in configuration)
-   resource "newrelic_notification_destination" "email_destination" {
-       account_id = 3919076 -> null
-       active     = true -> null
-       guid       = "MzkxOTA3NnxBSU9QU3xERVNUSU5BVElPTnxlN2MwYmY5ZS0zZTMyLTQ1NGUtOThlNi00MGFhMDY5NGFkYmM" -> null
-       id         = "e7c0bf9e-3e32-454e-98e6-40aa0694adbc" -> null
-       name       = "email_destination" -> null
-       status     = "DEFAULT" -> null
-       type       = "EMAIL" -> null
#        (1 unchanged attribute hidden)

-       property {
-           key           = "email" -> null
-           value         = "bret.mogilefsky@gsa.gov" -> null
#            (2 unchanged attributes hidden)
        }
    }

  # module.production.module.newrelic.newrelic_nrql_alert_condition.broken_link[0] will be updated in-place
!~  resource "newrelic_nrql_alert_condition" "broken_link" {
        id                             = "4902235:37859885"
!~      name                           = "Broken Link Detected on app.fac.gov" -> "Broken Link Detected"
+       runbook_url                    = "https://github.com/GSA-TTS/fac-team/blob/main/troubleshooting/new-relic-queries.md"
+       title_template                 = "PRODUCTION: {{conditionName}}"
#        (17 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # module.production.module.newrelic.newrelic_nrql_alert_condition.db_slow_queries will be updated in-place
!~  resource "newrelic_nrql_alert_condition" "db_slow_queries" {
!~      enabled                        = false -> true
        id                             = "4902235:37687582"
!~      name                           = "Production DB Statement Duration" -> "DB Statement Duration Exceeds Threshold"
+       runbook_url                    = "https://github.com/GSA-TTS/fac-team/blob/main/troubleshooting/new-relic-queries.md"
+       title_template                 = "PRODUCTION: {{conditionName}}"
#        (16 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # module.production.module.newrelic.newrelic_nrql_alert_condition.error_rate will be updated in-place
!~  resource "newrelic_nrql_alert_condition" "error_rate" {
        id                             = "4902235:37686401"
!~      name                           = "gsa-fac-production - Error rate" -> "Unusual Error Rate Detected"
+       runbook_url                    = "https://github.com/GSA-TTS/fac-team/blob/main/troubleshooting/new-relic-queries.md"
+       title_template                 = "PRODUCTION: {{conditionName}}"
#        (19 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # module.production.module.newrelic.newrelic_nrql_alert_condition.error_transactions will be destroyed
  # (because newrelic_nrql_alert_condition.error_transactions is not in configuration)
-   resource "newrelic_nrql_alert_condition" "error_transactions" {
-       account_id                     = 3919076 -> null
-       aggregation_delay              = "120" -> null
-       aggregation_method             = "event_flow" -> null
-       aggregation_window             = 60 -> null
-       close_violations_on_expiration = false -> null
-       enabled                        = true -> null
-       entity_guid                    = "MzkxOTA3NnxBSU9QU3xDT05ESVRJT058NDI1OTM0Mjk" -> null
-       expiration_duration            = 0 -> null
-       fill_option                    = "none" -> null
-       fill_value                     = 0 -> null
-       id                             = "5422816:42593429" -> null
-       ignore_on_expected_termination = false -> null
-       name                           = "Error Transactions (%)" -> null
-       open_violation_on_expiration   = false -> null
-       policy_id                      = 5422816 -> null
-       type                           = "static" -> null
-       violation_time_limit           = "NON_MATCHABLE_LIMIT_VALUE" -> null
-       violation_time_limit_seconds   = 259200 -> null
#        (3 unchanged attributes hidden)

-       critical {
-           disable_health_status_reporting = false -> null
-           duration                        = 0 -> null
-           operator                        = "above" -> null
-           threshold                       = 5 -> null
-           threshold_duration              = 300 -> null
-           threshold_occurrences           = "all" -> null
#            (1 unchanged attribute hidden)
        }

-       nrql {
-           data_account_id   = 3919076 -> null
-           evaluation_offset = 0 -> null
-           query             = "SELECT percentage(count(*), WHERE error is true) FROM Transaction" -> null
#            (1 unchanged attribute hidden)
        }

-       warning {
-           disable_health_status_reporting = false -> null
-           duration                        = 0 -> null
-           operator                        = "above" -> null
-           threshold                       = 3 -> null
-           threshold_duration              = 300 -> null
-           threshold_occurrences           = "all" -> null
#            (1 unchanged attribute hidden)
        }
    }

  # module.production.module.newrelic.newrelic_nrql_alert_condition.http_499_errors will be created
+   resource "newrelic_nrql_alert_condition" "http_499_errors" {
+       account_id                   = (known after apply)
+       aggregation_window           = (known after apply)
+       enabled                      = true
+       entity_guid                  = (known after apply)
+       id                           = (known after apply)
+       name                         = "HTTP 499 Errors Detected"
+       policy_id                    = 4902235
+       runbook_url                  = "https://github.com/GSA-TTS/fac-team/blob/main/troubleshooting/new-relic-queries.md"
+       title_template               = "PRODUCTION: {{conditionName}}"
+       type                         = "static"
+       violation_time_limit         = (known after apply)
+       violation_time_limit_seconds = 259200

+       critical {
+           disable_health_status_reporting = false
+           operator                        = "above_or_equals"
+           threshold                       = 10
+           threshold_duration              = 120
+           threshold_occurrences           = "all"
        }

+       nrql {
+           data_account_id = (known after apply)
+           query           = "FROM Log SELECT count(*) WHERE tags.space_name ='production' AND (message LIKE '%context canceled%' OR message LIKE '%endpoint_failure%' OR message LIKE '%HTTP/1.1\" 499%')"
        }
    }

  # module.production.module.newrelic.newrelic_nrql_alert_condition.http_500_errors will be updated in-place
!~  resource "newrelic_nrql_alert_condition" "http_500_errors" {
        id                             = "4902235:37694285"
!~      name                           = "Production Request Received a 500 Status" -> "HTTP 500 Errors Detected"
+       runbook_url                    = "https://github.com/GSA-TTS/fac-team/blob/main/troubleshooting/new-relic-queries.md"
+       title_template                 = "PRODUCTION: {{conditionName}}"
#        (17 unchanged attributes hidden)

-       critical {
-           disable_health_status_reporting = false -> null
-           duration                        = 0 -> null
-           operator                        = "above" -> null
-           threshold                       = 0 -> null
-           threshold_duration              = 60 -> null
-           threshold_occurrences           = "all" -> null
#            (1 unchanged attribute hidden)
        }

+       warning {
+           disable_health_status_reporting = false
+           operator                        = "above"
+           threshold                       = 5
+           threshold_duration              = 300
+           threshold_occurrences           = "all"
        }

#        (1 unchanged block hidden)
    }

  # module.production.module.newrelic.newrelic_nrql_alert_condition.infected_file will be updated in-place
!~  resource "newrelic_nrql_alert_condition" "infected_file" {
        id                             = "4902235:41525813"
!~      name                           = "Infected File Found!" -> "Infected File Found"
+       runbook_url                    = "https://github.com/GSA-TTS/fac-team/blob/main/troubleshooting/new-relic-queries.md"
+       title_template                 = "PRODUCTION: {{conditionName}}"
#        (17 unchanged attributes hidden)

!~      nrql {
!~          query             = "SELECT count(*) FROM Log WHERE tags.space_name ='production' and message LIKE '%ScanResult.INFECTED%'" -> "SELECT count(*) FROM Log WHERE tags.space_name ='production' AND message LIKE '%ScanResult.INFECTED%'"
#            (3 unchanged attributes hidden)
        }

#        (1 unchanged block hidden)
    }

  # module.production.module.newrelic.newrelic_nrql_alert_condition.infected_file_found will be destroyed
  # (because newrelic_nrql_alert_condition.infected_file_found is not in configuration)
-   resource "newrelic_nrql_alert_condition" "infected_file_found" {
-       account_id                     = 3919076 -> null
-       aggregation_delay              = "120" -> null
-       aggregation_method             = "event_flow" -> null
-       aggregation_window             = 60 -> null
-       close_violations_on_expiration = false -> null
-       enabled                        = true -> null
-       entity_guid                    = "MzkxOTA3NnxBSU9QU3xDT05ESVRJT058NDI1OTM0Mjg" -> null
-       expiration_duration            = 0 -> null
-       fill_option                    = "static" -> null
-       fill_value                     = 0 -> null
-       id                             = "5422816:42593428" -> null
-       ignore_on_expected_termination = false -> null
-       name                           = "Infected File Found!" -> null
-       open_violation_on_expiration   = false -> null
-       policy_id                      = 5422816 -> null
-       type                           = "static" -> null
-       violation_time_limit           = "NON_MATCHABLE_LIMIT_VALUE" -> null
-       violation_time_limit_seconds   = 259200 -> null
#        (3 unchanged attributes hidden)

-       critical {
-           disable_health_status_reporting = false -> null
-           duration                        = 0 -> null
-           operator                        = "above_or_equals" -> null
-           threshold                       = 1 -> null
-           threshold_duration              = 300 -> null
-           threshold_occurrences           = "at_least_once" -> null
#            (1 unchanged attribute hidden)
        }

-       nrql {
-           data_account_id   = 3919076 -> null
-           evaluation_offset = 0 -> null
-           query             = "SELECT count(*) FROM Log WHERE tags.space_name ='production' and message LIKE '%ScanResult.INFECTED%'" -> null
#            (1 unchanged attribute hidden)
        }
    }

  # module.production.module.newrelic.newrelic_nrql_alert_condition.long_running_web_fn will be destroyed
  # (because newrelic_nrql_alert_condition.long_running_web_fn is not in configuration)
-   resource "newrelic_nrql_alert_condition" "long_running_web_fn" {
-       account_id                     = 3919076 -> null
-       aggregation_delay              = "120" -> null
-       aggregation_method             = "event_flow" -> null
-       aggregation_window             = 60 -> null
-       close_violations_on_expiration = false -> null
-       enabled                        = false -> null
-       entity_guid                    = "MzkxOTA3NnxBSU9QU3xDT05ESVRJT058Mzc3NTk2Mjg" -> null
-       expiration_duration            = 0 -> null
-       fill_option                    = "none" -> null
-       fill_value                     = 0 -> null
-       id                             = "4902235:37759628" -> null
-       ignore_on_expected_termination = false -> null
-       name                           = "Long Running Web Function ( > 200ms)" -> null
-       open_violation_on_expiration   = false -> null
-       policy_id                      = 4902235 -> null
-       type                           = "static" -> null
-       violation_time_limit           = "NON_MATCHABLE_LIMIT_VALUE" -> null
-       violation_time_limit_seconds   = 259200 -> null
#        (3 unchanged attributes hidden)

-       critical {
-           disable_health_status_reporting = false -> null
-           duration                        = 0 -> null
-           operator                        = "above" -> null
-           threshold                       = 20 -> null
-           threshold_duration              = 60 -> null
-           threshold_occurrences           = "at_least_once" -> null
#            (1 unchanged attribute hidden)
        }

-       nrql {
-           data_account_id   = 3919076 -> null
-           evaluation_offset = 0 -> null
-           query             = "SELECT count(*) FROM Transaction  WHERE appName = 'gsa-fac-production' EXTRAPOLATE FACET name where name not like 'WebTransaction/Function/api.views:Sprite.get'" -> null
#            (1 unchanged attribute hidden)
        }
    }

  # module.production.module.newrelic.newrelic_nrql_alert_condition.response_time will be updated in-place
!~  resource "newrelic_nrql_alert_condition" "response_time" {
!~      enabled                        = false -> true
        id                             = "4902235:37686400"
!~      name                           = "gsa-fac-production - Response time (ms)" -> "Unusual Response Time Detected"
+       runbook_url                    = "https://github.com/GSA-TTS/fac-team/blob/main/troubleshooting/new-relic-queries.md"
+       title_template                 = "PRODUCTION: {{conditionName}}"
#        (18 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # module.production.module.newrelic.newrelic_nrql_alert_condition.slow_transactions will be updated in-place
!~  resource "newrelic_nrql_alert_condition" "slow_transactions" {
!~      enabled                        = false -> true
        id                             = "4902235:37756642"
!~      name                           = "Slow Transactions" -> "Transaction Duration Exceeds Threshold"
+       runbook_url                    = "https://github.com/GSA-TTS/fac-team/blob/main/troubleshooting/new-relic-queries.md"
+       title_template                 = "PRODUCTION: {{conditionName}}"
#        (16 unchanged attributes hidden)

!~      nrql {
!~          query             = "SELECT count(*) from Transaction where appName = 'gsa-fac-production' facet name" -> "SELECT count(*) FROM Transaction WHERE appName = 'gsa-fac-production' AND duration > 5 FACET name"
#            (3 unchanged attributes hidden)
        }

!~      warning {
!~          threshold                       = 15 -> 10
!~          threshold_duration              = 300 -> 120
!~          threshold_occurrences           = "all" -> "at_least_once"
#            (4 unchanged attributes hidden)
        }
    }

  # module.production.module.newrelic.newrelic_nrql_alert_condition.synth_uptime_check will be updated in-place
!~  resource "newrelic_nrql_alert_condition" "synth_uptime_check" {
        id                             = "4902235:37859880"
!~      name                           = "Ping of app.fac.gov failed" -> "Ping of application failed"
+       runbook_url                    = "https://github.com/GSA-TTS/fac-team/blob/main/troubleshooting/new-relic-queries.md"
+       title_template                 = "PRODUCTION: {{conditionName}}"
#        (17 unchanged attributes hidden)

!~      critical {
!~          threshold_duration              = 300 -> 120
#            (6 unchanged attributes hidden)
        }

#        (1 unchanged block hidden)
    }

  # module.production.module.newrelic.newrelic_nrql_alert_condition.throughput will be updated in-place
!~  resource "newrelic_nrql_alert_condition" "throughput" {
!~      enabled                        = false -> true
        id                             = "4902235:37686399"
!~      name                           = "gsa-fac-production - Throughput" -> "Unusual Request Volume Detected"
+       runbook_url                    = "https://github.com/GSA-TTS/fac-team/blob/main/troubleshooting/new-relic-queries.md"
+       title_template                 = "PRODUCTION: {{conditionName}}"
#        (18 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

  # module.production.module.newrelic.newrelic_nrql_alert_condition.transaction_error will be updated in-place
!~  resource "newrelic_nrql_alert_condition" "transaction_error" {
        id                             = "4902235:37751903"
!~      name                           = "Transaction Error Occured" -> "Transaction Errors Occured"
+       runbook_url                    = "https://github.com/GSA-TTS/fac-team/blob/main/troubleshooting/new-relic-queries.md"
+       title_template                 = "PRODUCTION: {{conditionName}}"
#        (17 unchanged attributes hidden)

!~      critical {
!~          threshold                       = 1 -> 5
!~          threshold_duration              = 60 -> 300
!~          threshold_occurrences           = "at_least_once" -> "all"
#            (4 unchanged attributes hidden)
        }

!~      nrql {
!~          query             = "select count(*) from TransactionError where (error.message != 'bad role' and appName = 'gsa-fac-production') FACET error.message, request.uri, error.class " -> "SELECT count(*) FROM TransactionError WHERE (error.message != 'bad role' and appName = 'gsa-fac-production') FACET error.message, request.uri, error.class "
#            (3 unchanged attributes hidden)
        }
    }

  # module.production.module.newrelic.newrelic_workflow.alert_workflow will be destroyed
  # (because newrelic_workflow.alert_workflow is not in configuration)
-   resource "newrelic_workflow" "alert_workflow" {
-       account_id            = 3919076 -> null
-       destinations_enabled  = true -> null
-       enabled               = true -> null
-       enrichments_enabled   = true -> null
-       guid                  = "MzkxOTA3NnxBSU9QU3xXT1JLRkxPV3xkNzI1YzNhNC1iODY1LTQzMmMtODU3ZS1hN2YxMjMzOTc5M2E" -> null
-       id                    = "d725c3a4-b865-432c-857e-a7f12339793a" -> null
-       last_run              = "2026-01-26T23:14:32.645Z" -> null
-       muting_rules_handling = "DONT_NOTIFY_FULLY_MUTED_ISSUES" -> null
-       name                  = "production_alert_workflow" -> null
-       workflow_id           = "d725c3a4-b865-432c-857e-a7f12339793a" -> null

-       destination {
-           channel_id              = "574ef83e-304c-4097-a367-d1c4e2278d91" -> null
-           name                    = "production_email_notification_channel" -> null
-           notification_triggers   = [
-               "ACKNOWLEDGED",
-               "ACTIVATED",
-               "CLOSED",
            ] -> null
-           type                    = "EMAIL" -> null
-           update_original_message = true -> null
        }

-       issues_filter {
-           filter_id = "2f4e1c77-5496-4e01-af2b-b6d6a54253ff" -> null
-           name      = "filter" -> null
-           type      = "FILTER" -> null

-           predicate {
-               attribute = "labels.policyIds" -> null
-               operator  = "EXACTLY_MATCHES" -> null
-               values    = [
-                   "5422816",
                ] -> null
            }
        }
    }

Plan: 5 to add, 10 to change, 8 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #463](https://github.com/GSA-TTS/FAC/actions/runs/22347588750)